pragun/super_mouse_stm32f4_usb_host/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
/**
  ******************************************************************************
  * @file    usbh_hid.c
  * @author  MCD Application Team
  * @brief   This file is the HID Layer Handlers for USB Host HID class.
  *
  * @verbatim
  *
  *          ===================================================================
  *                                HID Class  Description
  *          ===================================================================
  *           This module manages the HID class V1.11 following the "Device Class Definition
  *           for Human Interface Devices (HID) Version 1.11 Jun 27, 2001".
  *           This driver implements the following aspects of the specification:
  *             - The Boot Interface Subclass
  *             - The Mouse and Keyboard protocols
  *
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      http://www.st.com/SLA0044
  *
  ******************************************************************************
  */

  /* BSPDependencies
  - "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
  - "stm32xxxxx_{eval}{discovery}_io.c"
  - "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
  - "stm32xxxxx_{eval}{discovery}_sdram.c"
  EndBSPDependencies */

/* Includes ------------------------------------------------------------------*/
#include "usbh_hid.h"
#include "usbh_hid_parser.h"
#include "stdbool.h"


/** @addtogroup USBH_LIB
* @{
*/

/** @addtogroup USBH_CLASS
* @{
*/

/** @addtogroup USBH_HID_CLASS
* @{
*/

/** @defgroup USBH_HID_CORE
* @brief    This file includes HID Layer Handlers for USB Host HID class.
* @{
*/

/** @defgroup USBH_HID_CORE_Private_TypesDefinitions
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Defines
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Macros
* @{
*/
/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_Variables
* @{
*/

/**
* @}
*/


/** @defgroup USBH_HID_CORE_Private_FunctionPrototypes
* @{
*/

static USBH_StatusTypeDef USBH_HID_InterfaceInit  (USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_InterfaceDeInit  (USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost);
static void  USBH_HID_ParseHIDDesc (HID_DescTypeDef *desc, uint8_t *buf);

static USBH_StatusTypeDef USBH_HID_InterfaceInitHelper(USBH_HandleTypeDef *phost, uint8_t protocol);
extern USBH_StatusTypeDef USBH_HID_MouseInit(USBH_HandleTypeDef *phost, uint8_t interface);
extern USBH_StatusTypeDef USBH_HID_KeybdInit(USBH_HandleTypeDef *phost, uint8_t interface);

extern uint8_t MouseCallback(USBH_HandleTypeDef *phost, uint8_t *buff, uint8_t len);
extern uint8_t KeyboardCallback(USBH_HandleTypeDef *phost, uint8_t *buff, uint8_t len);
extern uint8_t PrintHexBuf(uint8_t *buff, uint8_t len);

USBH_ClassTypeDef  HID_Class =
{
  "HID",
  USB_HID_CLASS,
  USBH_HID_InterfaceInit,
  USBH_HID_InterfaceDeInit,
  USBH_HID_ClassRequest,
  USBH_HID_Process,
  USBH_HID_SOFProcess,
  NULL,
};


/**
* @}
*/

/** @defgroup USBH_HID_CORE_Private_Functions
* @{
*/


/**
  * @brief  USBH_HID_InterfaceInit
  *         The function init the HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */


static USBH_StatusTypeDef USBH_HID_InterfaceInit (USBH_HandleTypeDef *phost)
{
  uint8_t protocol_list[] = {HID_MOUSE_BOOT_CODE,HID_KEYBRD_BOOT_CODE};
  uint8_t i = 0U;
  USBH_StatusTypeDef statuses[] = {USBH_FAIL,USBH_FAIL};
  USBH_StatusTypeDef status = USBH_FAIL;

  phost->pActiveClass->pData = (HID_HandleTypeDef *)USBH_malloc (sizeof(HID_Composite_TypeDef));
  HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
  HID_Composite->num_interfaces = 0;
  HID_Composite->interface_to_be_processed = 0;

  for ( ;i < HID_MAX_COMPOSITED_INTERFACES; i++){
	  statuses[i] = USBH_HID_InterfaceInitHelper(phost, protocol_list[i]);
  }

  if((statuses[0] == USBH_OK) && (statuses[1] == USBH_OK)){
	  status = USBH_OK;
  }
  return status;
}

static USBH_StatusTypeDef USBH_HID_InterfaceInitHelper(USBH_HandleTypeDef *phost, uint8_t protocol){

	uint8_t max_ep;
	uint8_t num = 0U;
	HID_HandleTypeDef* HID_Handle;
	uint8_t interface;
	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	USBH_StatusTypeDef status = USBH_FAIL;

  interface = USBH_FindInterface(phost, phost->pActiveClass->ClassCode, 0xFFU, protocol);

  if(interface == 0xFFU) /* No Valid Interface */
  {
	status = USBH_FAIL;
    USBH_DbgLog ("Cannot Find the interface for %s class.", phost->pActiveClass->Name);
  }
  else
  {
    USBH_SelectInterface (phost, interface);
    HID_Composite->HID_Handles[HID_Composite->num_interfaces] = (HID_HandleTypeDef *)USBH_malloc (sizeof(HID_HandleTypeDef));
    HID_Handle = HID_Composite->HID_Handles[HID_Composite->num_interfaces];
    HID_Composite->num_interfaces++;
    //phost->pActiveClass->pData = (HID_HandleTypeDef *)USBH_malloc (2*sizeof(HID_HandleTypeDef));
    //HID_Handle =  (HID_HandleTypeDef *) phost->pActiveClass->pData;
    //HID_Handle = &HID_Handles[hid_handle_count];

    HID_Handle->state = HID_ERROR;
    HID_Handle->interface = interface;

    /*Decode Bootclass Protocol: Mouse or Keyboard*/
    HID_Handle->supports_set_protocol = 0;
    if(phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bInterfaceSubClass == HID_BOOT_CODE)
    {
    	HID_Handle->supports_set_protocol = 1;
    }

    if(phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bInterfaceProtocol == HID_KEYBRD_BOOT_CODE)
    {
      USBH_UsrLog ("KeyBoard device found!");
      HAL_Delay(50);
      HID_Handle->Init =  USBH_HID_KeybdInit;
      HID_Handle->Callback = KeyboardCallback;
    }
    else if(phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bInterfaceProtocol  == HID_MOUSE_BOOT_CODE)
    {
      USBH_UsrLog ("Mouse device found!");
      HAL_Delay(50);
      HID_Handle->Init =  USBH_HID_MouseInit;
      HID_Handle->Callback = MouseCallback;
    }
    else
    {
      USBH_UsrLog ("Protocol not supported.");
      return USBH_FAIL;
    }

    HID_Handle->state     = HID_INIT;
    HID_Handle->ctl_state = HID_REQ_INIT;
    HID_Handle->ep_addr   = phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[0].bEndpointAddress;
    HID_Handle->length    = phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[0].wMaxPacketSize;
    HID_Handle->poll      = phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[0].bInterval ;

    if (HID_Handle->poll  < HID_MIN_POLL)
    {
      HID_Handle->poll = HID_MIN_POLL;
    }


    /* Check fo available number of endpoints */
    /* Find the number of EPs in the Interface Descriptor */
    /* Choose the lower number in order not to overrun the buffer allocated */
    max_ep = ( (phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bNumEndpoints <= USBH_MAX_NUM_ENDPOINTS) ?
              phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bNumEndpoints :
                  USBH_MAX_NUM_ENDPOINTS);


