pragun/super_mouse_stm32f4_usb_host/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
    /* Decode endpoint IN and OUT address from interface descriptor */
    for ( ;num < max_ep; num++)
    {
      if(phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[num].bEndpointAddress & 0x80U)
      {
        HID_Handle->InEp = (phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[num].bEndpointAddress);
        HID_Handle->InPipe  =\
          USBH_AllocPipe(phost, HID_Handle->InEp);

        /* Open pipe for IN endpoint */
        USBH_OpenPipe  (phost,
                        HID_Handle->InPipe,
                        HID_Handle->InEp,
                        phost->device.address,
                        phost->device.speed,
                        USB_EP_TYPE_INTR,
                        HID_Handle->length);

        USBH_LL_SetToggle (phost, HID_Handle->InPipe, 0U);

      }
      else
      {
        HID_Handle->OutEp = (phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].Ep_Desc[num].bEndpointAddress);
        HID_Handle->OutPipe  =\
          USBH_AllocPipe(phost, HID_Handle->OutEp);

        /* Open pipe for OUT endpoint */
        USBH_OpenPipe  (phost,
                        HID_Handle->OutPipe,
                        HID_Handle->OutEp,
                        phost->device.address,
                        phost->device.speed,
                        USB_EP_TYPE_INTR,
                        HID_Handle->length);

        USBH_LL_SetToggle (phost, HID_Handle->OutPipe, 0U);
      }

    }
    status = USBH_OK;
  }

  return status;
}

/**
  * @brief  USBH_HID_InterfaceDeInit
  *         The function DeInit the Pipes used for the HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
USBH_StatusTypeDef static USBH_HID_InterfaceDeInit (USBH_HandleTypeDef *phost)
{
	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	uint8_t num_interfaces = HID_Composite->num_interfaces;
	HID_HandleTypeDef	**HID_Handles =  HID_Composite->HID_Handles;
	HID_HandleTypeDef *HID_Handle;
	uint8_t i = 0;

	for (i=0; i<num_interfaces; i++){
		HID_Handle = HID_Handles[i];

		if(HID_Handle->InPipe != 0x00U)
		{
			USBH_ClosePipe  (phost, HID_Handle->InPipe);
			USBH_FreePipe  (phost, HID_Handle->InPipe);
			HID_Handle->InPipe = 0U;     /* Reset the pipe as Free */
		}

		if(HID_Handle->OutPipe != 0x00U)
		{
			USBH_ClosePipe(phost, HID_Handle->OutPipe);
			USBH_FreePipe  (phost, HID_Handle->OutPipe);
			HID_Handle->OutPipe = 0U;     /* Reset the pipe as Free */
		}
	}

	if(phost->pActiveClass->pData)
	{
		USBH_free (phost->pActiveClass->pData);
		phost->pActiveClass->pData = 0U;
	}

	return USBH_OK;
}

/**
  * @brief  USBH_HID_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost)
{

	USBH_StatusTypeDef status         = USBH_BUSY;
	USBH_StatusTypeDef classReqStatus = USBH_BUSY;
	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	uint8_t num_interfaces = HID_Composite->num_interfaces;
	HID_HandleTypeDef	**HID_Handles =  HID_Composite->HID_Handles;
	HID_HandleTypeDef *HID_Handle = HID_Handles[HID_Composite->interface_to_be_processed];
	uint8_t i = 0;
	bool hid_class_active = true;

	switch (HID_Handle->ctl_state)
	{
	case HID_REQ_INIT:
	case HID_REQ_GET_HID_DESC:
		/* Get HID Desc */
		if (USBH_HID_GetHIDDescriptor(phost, HID_Handle->interface, phost->device.Data, USB_HID_DESC_SIZE)== USBH_OK)
		{
			USBH_HID_ParseHIDDesc(&HID_Handle->HID_Desc, phost->device.Data);
			HID_Handle->ctl_state = HID_REQ_GET_REPORT_DESC;
		}

		break;
	case HID_REQ_GET_REPORT_DESC:
		/* Get Report Desc */
		if (USBH_HID_GetHIDReportDescriptor(phost, HID_Handle->interface, HID_Handle->report_descriptor, HID_Handle->HID_Desc.wItemLength) == USBH_OK)
		{
			/* The descriptor is available in phost->device.Data */
			printf("Received Report Descriptor for interface: %d, size:%d\r\n", HID_Handle->interface, HID_Handle->HID_Desc.wItemLength);
			PrintHexBuf(HID_Handle->report_descriptor, HID_Handle->HID_Desc.wItemLength);
			HID_Handle->ctl_state = HID_REQ_SET_IDLE;
			HAL_Delay(50);
		}

		break;

	case HID_REQ_SET_IDLE:

		classReqStatus = USBH_HID_SetIdle (phost, 0U, 0U, HID_Handle->interface);

		/* set Idle */
		if (classReqStatus == USBH_OK)
		{
			if (HID_Handle->supports_set_protocol){
				HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
			}else{
				HID_Handle->ctl_state = HID_REQ_IDLE;
			}

		}
		else
		{
			if(classReqStatus == USBH_NOT_SUPPORTED)
			{
				if (HID_Handle->supports_set_protocol){
					HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
				}else{
					HID_Handle->ctl_state = HID_REQ_IDLE;
				}
			}
		}
		break;

	case HID_REQ_SET_PROTOCOL:
		/* set protocol */
		if (USBH_HID_SetProtocol (phost, 0U, HID_Handle->interface) == USBH_OK)
		{
			HID_Handle->ctl_state = HID_REQ_IDLE;
		}
		break;

	case HID_REQ_IDLE:
	default:
		break;
	}

	for (i=0; i<num_interfaces; i++){
		// This favors an interface for processing if its control state hasn't progressed as much as the next to be processed interface
		if (HID_Composite->HID_Handles[i]->ctl_state < HID_Composite->HID_Handles[HID_Composite->interface_to_be_processed]->ctl_state){
			HID_Composite->interface_to_be_processed = i;
		}
	}

	//Check to make sure that all HID interfaces have a ctl_state of HID_REQ_IDLE before declaring the
	//HID class active
	for (i=0; i<num_interfaces; i++){
		hid_class_active = hid_class_active && (HID_Composite->HID_Handles[i]->ctl_state == HID_REQ_IDLE);
	}
	if(hid_class_active){
		phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
		status = USBH_OK;
	}

	return status;
}


//USBH_HID_Process_new
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost)
{
	USBH_StatusTypeDef status = USBH_OK;

	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	uint8_t num_interfaces = HID_Composite->num_interfaces;
	HID_HandleTypeDef	**HID_Handles =  HID_Composite->HID_Handles;
	HID_HandleTypeDef *HID_Handle = HID_Handles[HID_Composite->interface_to_be_processed];
	//HID_StateTypeDef  prev_state = HID_Handle->state;
	uint8_t i = 0;

	switch (HID_Handle->state)
	{
	case HID_INIT:
		HID_Handle->Init(phost, HID_Composite->interface_to_be_processed);
		HID_Handle->state = HID_IDLE;
		break;

	case HID_IDLE:
		status = USBH_HID_GetReport (phost, 0x01U, 0U, HID_Handle->pData, (uint8_t)HID_Handle->length, HID_Handle->interface);
		if (status == USBH_OK)
		{
			USBH_HID_FifoWrite(&HID_Handle->fifo, HID_Handle->pData, HID_Handle->length);
			HID_Handle->state = HID_SYNC;
		}
		else if (status == USBH_BUSY)
		{
			HID_Handle->state = HID_IDLE;
			status = USBH_OK;
		}
		else if (status == USBH_NOT_SUPPORTED)
		{
			HID_Handle->state = HID_SYNC;
			status = USBH_OK;
		}
		else
		{
			HID_Handle->state = HID_ERROR;
			status = USBH_FAIL;
		}

		break;

