pragun/super_mouse_stm32f4_usb_host/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
	case HID_SYNC:
		/* Sync with start of Even Frame */
		if(phost->Timer & 1U)
		{
			HID_Handle->state = HID_GET_DATA;
		}

		break;

	case HID_GET_DATA:
		USBH_InterruptReceiveData(phost, HID_Handle->pData,
				(uint8_t)HID_Handle->length,
				HID_Handle->InPipe);

		HID_Handle->state = HID_POLL;
		HID_Handle->timer = phost->Timer;
		HID_Handle->DataReady = 0U;
		break;

	case HID_POLL:
		if(USBH_LL_GetURBState(phost , HID_Handle->InPipe) == USBH_URB_DONE)
		{
			if(HID_Handle->DataReady == 0U)
			{
				USBH_HID_FifoWrite(&HID_Handle->fifo, HID_Handle->pData, HID_Handle->length);
				HID_Handle->DataReady = 1U;
				HID_Handle->Callback(phost,HID_Handle->pData, HID_Handle->length);
				//USBH_HID_EventCallback(phost);

#if (USBH_USE_OS == 1U)
				phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
				(void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
				(void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
			}
		}
		else
		{
			/* IN Endpoint Stalled */
			if(USBH_LL_GetURBState(phost, HID_Handle->InPipe) == USBH_URB_STALL)
			{
				/* Issue Clear Feature on interrupt IN endpoint */
				if(USBH_ClrFeature(phost, HID_Handle->ep_addr) == USBH_OK)
				{
					/* Change state to issue next IN token */
					HID_Handle->state = HID_GET_DATA;
				}
			}
		}
		break;

	default:
		break;
	}

	HID_Composite->interface_to_be_processed = (HID_Composite->interface_to_be_processed + 1) % num_interfaces;
	for (i=0; i<num_interfaces; i++){
		// This favors an interface for processing if its control state hasn't progressed as much as the next to be processed interface
		if (HID_Composite->HID_Handles[i]->state < HID_Handle->state){
			HID_Composite->interface_to_be_processed = i;
		}
	}

	return status;
}


/**
  * @brief  USBH_HID_SOFProcess
  *         The function is for managing the SOF Process
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost)
{
	HID_Composite_TypeDef* HID_Composite = (HID_Composite_TypeDef*) phost->pActiveClass->pData;
	uint8_t num_interfaces = HID_Composite->num_interfaces;
	HID_HandleTypeDef	**HID_Handles =  HID_Composite->HID_Handles;
	HID_HandleTypeDef *HID_Handle;
	uint8_t i = 0;

	for (i=0; i<num_interfaces; i++){
		HID_Handle = HID_Handles[i];
		if(HID_Handle->state == HID_POLL)
		  {
		    if(( phost->Timer - HID_Handle->timer) >= HID_Handle->poll)
		    {
		      HID_Handle->state = HID_GET_DATA;
		    }
		  }
	}
  return USBH_OK;
}

/**
* @brief  USBH_Get_HID_ReportDescriptor
  *         Issue report Descriptor command to the device. Once the response
  *         received, parse the report descriptor and update the status.
  * @param  phost: Host handle
  * @param  Length : HID Report Descriptor Length
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_GetHIDReportDescriptor(USBH_HandleTypeDef *phost,
													uint8_t wIndex, uint8_t *buf,
                                                    uint16_t length)
{

  USBH_StatusTypeDef status;

  /*
  status = USBH_GetDescriptor(phost,
                              USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
                              USB_DESC_HID_REPORT,
                              phost->device.Data,
                              length);
                              */

  status = USBH_GetDescriptor_wIndex( phost,
		  	  	  	  	  	  	  	  USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
									  USB_DESC_HID_REPORT,
									  wIndex,
									  buf,
									  length);

  /* HID report descriptor is available in phost->device.Data.
  In case of USB Boot Mode devices for In report handling ,
  HID report descriptor parsing is not required.
  In case, for supporting Non-Boot Protocol devices and output reports,
  user may parse the report descriptor*/


  return status;
}

/**
  * @brief  USBH_Get_HID_Descriptor
  *         Issue HID Descriptor command to the device. Once the response
  *         received, parse the report descriptor and update the status.
  * @param  phost: Host handle
  * @param  Length : HID Descriptor Length
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_GetHIDDescriptor (USBH_HandleTypeDef *phost, uint8_t wIndex,
                                              uint8_t *buf, uint16_t length)
{
  USBH_StatusTypeDef status;

  /* status = USBH_GetDescriptor(phost,
                              USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
                              USB_DESC_HID,
                              phost->device.Data,
                              length); */

  status = USBH_GetDescriptor_wIndex( phost,
  		  	  	  	  	  	  	  	  USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
									  USB_DESC_HID,
  									  wIndex,
									  buf,
  									  length);

  return status;
}

/**
  * @brief  USBH_Set_Idle
  *         Set Idle State.
  * @param  phost: Host handle
  * @param  duration: Duration for HID Idle request
  * @param  reportId : Targeted report ID for Set Idle request
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_SetIdle (USBH_HandleTypeDef *phost,
                                     uint8_t duration,
                                     uint8_t reportId,
									 uint8_t interface)
{

  phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE |\
    USB_REQ_TYPE_CLASS;


  phost->Control.setup.b.bRequest = USB_HID_SET_IDLE;
  phost->Control.setup.b.wValue.w = (uint16_t)(((uint32_t)duration << 8U) | (uint32_t)reportId);

  phost->Control.setup.b.wIndex.w = interface;
  phost->Control.setup.b.wLength.w = 0U;

  return USBH_CtlReq(phost, 0U, 0U);
}


/**
  * @brief  USBH_HID_Set_Report
  *         Issues Set Report
  * @param  phost: Host handle
  * @param  reportType  : Report type to be sent
  * @param  reportId    : Targeted report ID for Set Report request
  * @param  reportBuff  : Report Buffer
  * @param  reportLen   : Length of data report to be send
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_HID_SetReport (USBH_HandleTypeDef *phost,
                                    uint8_t reportType,
                                    uint8_t reportId,
                                    uint8_t* reportBuff,
                                    uint8_t reportLen)
{

  phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE |\
    USB_REQ_TYPE_CLASS;


